/*************************************************
 *
 * @nt
 *
 * // :::: 之前的每个公司离开的原因
 *
 * 1、首先是，国际在线，刚毕业进入的一家公司，离开的原因是个人发展
 *       那会前端正在蓬勃发展，希望能进入一个有技术土壤的地方提升自己的技术能力
 *
 * 2、第二家公司是，百度，离开的原因也是一个客观因素，那会百度游戏部门整体被一个游戏公司收购了
 *      那会公司要求 大家做合同变更 或者 选择离开 做选择，那会刚好有同事在美团然后就内推我过去了
 *      所以就到了美团这边
 *
 * 3、在美团这边选择离开的原因是 是个人发展诉求，那会期望能够做团队管理或前端架构的工作，
 *     所以选择去了一家创业公司做前端架构！
 *
 * 4、 在这家创业公司，有足够多的空间 ，折腾很多有意思事情，
 *     离开的原因是我父母需要做手术（基础病比较多：颈椎间盘突出 + 风湿等），需要回家照顾。
 *     那会回家待了一个多月照顾我父母
 *
 *  5、然后就加入了贝壳，加入贝壳的原因是孵化创新业务 商业地产的市场前景给 吸引力了。
 *      另外有 带团队及做前端技术架构等机会。
 *      离开的原因是一个客观因素：
 *          房产受到疫情及大环境影响，贝壳业务及团队整体都在收缩调整
 *
 ************************************************/
