/*************************************************
 *
 * @nt === 》 not tech 非技术问题
 *
 * // ::::请简单自我介绍一下
 *
 *   面试官，您好，我叫李广卫，
 *   我就在北京上的学，因为比较热爱前端，毕业以后一直做前端开发
 *   之前先后在百度、美团等互联公司做前端工作，也算是见证了前端这些年的蓬勃发展。
 *   最近3年的主要经历是是在贝壳找房商业地产团队做前端负责人。
 *
 *   简单说下之前做过的事情：
 *   【业务方向呢】，无论是B侧中后台SaaS能力建设，还是C端用户增长、用户体验或者是运营体系 建设都有较多实践。
 *   【端】另外无论是PC、H5、小程序、甚至客户端、又或者是服务端(主要是node.js) 等都有过实践。
 *   【技术方向上看呢】 对前端性能、前端工程化、数据可视化都有过实际落地经验。
 *   【近几年关注点】
 *         1、对前端研发提效，如跨端、前端标准化建设、公共能力及组件资产沉淀、前端研发流程（亦或是开发者体验）
 *         2、前端横向的工作，比如整个前端质量稳定性、线上问题治理、团队内外影响力事情（共建合作技术项目或者联合分享）。
 *         3、贴近业务，技术赋能业务项目，助力业务目标达成。
 *
 *    最后，记得说声"谢谢！"
 *
 ************************************************/
